---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.CurveFailures
source: html/a5275643-db1e-eb79-8e4c-d896ba5a1cba.htm
---
# BuiltInFailures.CurveFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.